system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5 -1.5 0) //0
    ( 0.5 -1.5 0) //1
    ( 0.5  1.5 0) //2
    (-0.5  1.5 0) //3
    (-0.5 -1.5 0.1) //4
    ( 0.5 -1.5 0.1) //5
    ( 0.5  1.5 0.1) //6
    (-0.5  1.5 0.1) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (75 300 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 7 4 0)
            //(3 2 6 7)
            (6 2 1 5)
            (0 4 5 1)
        );
    }
    atmosphere
    {
        type patch;
        faces
	(
	    (3 2 6 7)
	);
    }
    frontAndBack
    {
     type empty;
    faces
    (
           (0 1 2 3)
           (7 6 5 4)
    );
    }
);


// ************************************************************************* //
